---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCRange.#ctor
source: html/70025e31-0331-eaf3-1120-4863199c968a.htm
---
# Autodesk.Revit.DB.IFC.IFCRange.#ctor Method

Instantiates a default IFCRange object.

## Syntax (C#)
```csharp
public IFCRange()
```

## Remarks
The starting and ending value are both set to zero.